EA/src/DataProcessors/ПечатьШКМестХраненияЗСЯ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ПечатьШКМестХраненияЗСЯ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗонаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтелажС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтелажПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

EA/src/Catalogs/МестоЗСЯ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>МестоЗСЯ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМестаЗСЯ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМестЗСЯ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удобство</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗонаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/DataProcessors/ПечатьШКМестХраненияЗСЯ/Ext/ManagerModule.bsl
Функция СформироватьТабличныйДокументС_ШК_ЗСЯ(МассивЗСЯ) Экспорт
	
	ТД = Новый ТабличныйДокумент;
	ТД.ПолеСверху = 0;
	ТД.ПолеСнизу = 0;
	ТД.ПолеСлева = 0;
	ТД.ПолеСправа = 0;
	ТД.РазмерКолонтитулаСверху = 0; 
	ТД.РазмерКолонтитулаСнизу = 0;	
	
	Если ТипЗнч(МассивЗСЯ) <> Тип("Массив") или МассивЗСЯ.Количество() = 0 тогда
		Возврат ТД;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестоЗСЯ.Зона,
	|	МестоЗСЯ.Стеллаж,
	|	МестоЗСЯ.Ячейка,
	|	МестоЗСЯ.ЗонаСсылка
	|ИЗ
	|	Справочник.МестоЗСЯ КАК МестоЗСЯ
	|ГДЕ
	|	МестоЗСЯ.Ссылка В(&МассивЗСЯ)";
	Запрос.УстановитьПараметр("МассивЗСЯ",МассивЗСЯ);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	МакетШК = Обработки.ПечатьШКМестХраненияЗСЯ.ПолучитьМакет("МакетШтрихКода");
	ОбластьШК = МакетШК.ПолучитьОбласть("ШтрихКод");
	
	ПараметрыШтрихКода = Новый Структура;
	ПараметрыШтрихКода.Вставить("Ширина",60);
	ПараметрыШтрихКода.Вставить("Высота",160);
	ПараметрыШтрихКода.Вставить("ОтображатьТекст",Истина);
	ПараметрыШтрихКода.Вставить("УголПоворота",270);
	ПараметрыШтрихКода.Вставить("ОтображатьТекст",Истина);
	ПараметрыШтрихКода.Вставить("ТипКода",1);
	ПараметрыШтрихКода.Вставить("ПрозрачныйФон");	
	
	ТДСтраница = Новый ТабличныйДокумент;

	ТДСтраница.ПолеСверху = 0;
	ТДСтраница.ПолеСнизу = 0;
	ТДСтраница.ПолеСлева = 0;
	ТДСтраница.ПолеСправа = 0;
	ТДСтраница.РазмерКолонтитулаСверху = 0; 
	ТДСтраница.РазмерКолонтитулаСнизу = 0;	

	МассивОбластейПрис = Новый Массив;
	МассивОбластейВывод = Новый Массив;
	Нстр = Истина;
	Для каждого МестоЗСЯ из Таблица цикл
		ПараметрыШтрихКода.Вставить("Штрихкод",справочники.МестоЗСЯ.СформироватьШКМестаЗСЯ(МестоЗСЯ));	
		ОбластьШК.Рисунки.ШК.Картинка = ПечатьСервер.ПолучитьКартинкуШтрихкода(ПараметрыШтрихКода);
		ОбластьШК.Параметры.Зона = МестоЗСЯ.Зона;
		ОбластьШК.Параметры.ст = МестоЗСЯ.Стеллаж;
		ОбластьШК.Параметры.яч = МестоЗСЯ.Ячейка;
		Если Нстр тогда	
			ТД.Вывести(ОбластьШК);
			Нстр = ложь;
			МассивОбластейВывод.Добавить(ОбластьШК);
			МассивОбластейПрис.Добавить(ОбластьШК);
			Продолжить;
		КонецЕсли;	
		
		МассивОбластейПрис.Добавить(ОбластьШК);
		Если не ТДСтраница.ПроверитьПрисоединение(МассивОбластейПрис) тогда
			МассивОбластейПрис.Очистить();
			МассивОбластейПрис.Добавить(ОбластьШК);
			МассивОбластейВывод.Добавить(ОбластьШК);
			Если не ТДСтраница.ПроверитьВывод(МассивОбластейВывод) тогда
				ТД.ВывестиГоризонтальныйРазделительСтраниц();
				МассивОбластейВывод.Очистить();
			КонецЕсли;
			ТД.Вывести(ОбластьШК);
		Иначе
			ТД.Присоединить(ОбластьШК);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТД;
КонецФункции
